betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_adc.c
    itmask = (uint8_t)(ADC_IT >> 8);
    ADCx->STATR = ~(uint32_t)itmask;
}

/*********************************************************************
 * @fn      TempSensor_Volt_To_Temper
 *
 * @brief   Internal Temperature Sensor Voltage to temperature.
 *
 * @param   Value - Voltage Value(mv).
 *
 * @return  Temper - Temperature Value.
 */
s32 TempSensor_Volt_To_Temper(s32 Value)
{
    s32 Temper, Refer_Volt, Refer_Temper;
    s32 k = 43;
    FLASH_BOOT_GetMode( );
    Refer_Volt = (s32)((*(u32 *)0x1FFFF76C) & 0x0000FFFF);
    Refer_Temper = (s32)(((*(u32 *)0x1FFFF76C) >> 16) & 0x0000FFFF);

    Temper = Refer_Temper - ((Value - Refer_Volt) * 10 + (k >> 1)) / k;

    return Temper;
}

/*********************************************************************
 * @fn      ADC_BufferCmd
 *
 * @brief   Enables or disables the ADCx buffer.
 *
 * @param   ADCx - where x can be 1 or 2 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_BufferCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR1 |= ADC_BUFEN;
    }
    else
    {
        ADCx->CTLR1 &= ~ADC_BUFEN;
    }
}

/*********************************************************************
 * @fn      ADC_ANA_RST_Cmd
 *
 * @brief   Enables or disables the ADCx ANA RST.
 *
 * @param   ADCx - where x can be 1 or 2 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_ANA_RST_Cmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR1 |= ADC_ANA_RST;
    }
    else
    {
        ADCx->CTLR1 &= ~ADC_ANA_RST;
    }
}
/*********************************************************************
 * @fn      ADC_SW_PRE_Cmd
 *
 * @brief   Enables or disables the ADCx SW_PRE.
 *
 * @param   ADCx - where x can be 1 or 2 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_SW_PRE_Cmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR1 |= ADC_SW_PRE;
    }
    else
    {
        ADCx->CTLR1 &= ~ADC_SW_PRE;
    }
}

/*********************************************************************
 * @fn      ADC_TO_DFSDM_Cmd
 *
 * @brief   Enables or disables the ADCx sample data t0 DFSDM.
 *
 * @param   ADCx - where x can be 1 or 2 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_TO_DFSDM_Cmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->AUX |= ADC_TO_DFSDM;
    }
    else
    {
        ADCx->AUX &= ~ADC_TO_DFSDM;
    }
}

/*********************************************************************
 * @fn      ADC_SMP_ModeConfig
 *
 * @brief   Enables or disables the ADCx TO SMP SEL.
 *
 * @param   ADCx - where x can be 1 or 2 to select the ADC peripheral.
 *          ADC_Channel - the ADC channel to configure.
 *            ADC_Channel_0 - ADC Channel0 selected.
 *            ADC_Channel_1 - ADC Channel1 selected.
 *            ADC_Channel_2 - ADC Channel2 selected.
 *            ADC_Channel_3 - ADC Channel3 selected.
 *            ADC_Channel_4 - ADC Channel4 selected.
 *            ADC_Channel_5 - ADC Channel5 selected.
 *            ADC_Channel_6 - ADC Channel6 selected.
 *            ADC_Channel_7 - ADC Channel7 selected.
 *            ADC_Channel_8 - ADC Channel8 selected.
 *            ADC_Channel_9 - ADC Channel9 selected.
 *            ADC_Channel_10 - ADC Channel10 selected.
 *            ADC_Channel_11 - ADC Channel11 selected.
 *            ADC_Channel_12 - ADC Channel12 selected.
 *            ADC_Channel_13 - ADC Channel13 selected.
 *            ADC_Channel_14 - ADC Channel14 selected.
 *            ADC_Channel_15 - ADC Channel15 selected.
 *            ADC_Channel_16 - ADC Channel16 selected.
 *            ADC_Channel_17 - ADC Channel17 selected.
 *          SMP_Mode - configer SMPx mode.
 *            ADC_SMP_CFG_MODE0 - SMPx mode 0.
 *            ADC_SMP_CFG_MODE1 - SMPx mode 1.
 *
 * @return  none
 */
void ADC_SMP_ModeConfig(ADC_TypeDef *ADCx, uint8_t ADC_Channel, uint8_t SMP_Mode)
{
    if(SMP_Mode == ADC_SMP_CFG_MODE1)
    {
        ADCx->AUX |= (1 << ADC_Channel);
    }
    else if(SMP_Mode == ADC_SMP_CFG_MODE1)
    {
        ADCx->AUX &= ~(1 << ADC_Channel);
    }
}

/*********************************************************************
 * @fn      ADC_LowPowerModeCmd
 *
 * @brief   Enables or disables the specified ADC low power mode peripheral.
 *
 * @param   ADCx - where x can be 1 or 2 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_LowPowerModeCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR2 |= (1 << 7);
    }
    else
    {
        ADCx->CTLR2 &= ~(1 << 7);
    }
}

/*********************************************************************
 * @fn      ADC_HD_CalibrationCmd
 *
 * @brief   Enables or disables the specified ADC hardware Calibration.
 *
 * @param   ADCx - where x can be 1 or 2 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_HD_CalibrationCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR2 |= (1 << 6);
    }
    else
    {
        ADCx->CTLR2 &= ~(1 << 6);
    }
}

/*********************************************************************
 * @fn      ADC_SMP_ModeConfig
 *
 * @brief   Enables or disables the ADCx TO SMP SEL.
 *
 * @param   ADCx - where x can be 1 or 2 to select the ADC peripheral.
 *          SMP_Mode - configer SMPx mode.
 *            ADC_CalibrationVoltage_Mode0 - Calibration voltage 0.
 *            ADC_CalibrationVoltage_Mode1 - Calibration voltage 1.
 *            ADC_CalibrationVoltage_Mode2 - Calibration voltage 2.
 *            ADC_CalibrationVoltage_Mode3 - Calibration voltage 3.
 *
 * @return  none
 */
void ADC_CalibrationVoltageConfig(ADC_TypeDef *ADCx, uint8_t CalibrationVoltage_Mode)
{
    ADCx->CTLR2 &= ~ADC_CalibrationVoltage_Mode3;
    ADCx->CTLR2 |= CalibrationVoltage_Mode;
}

